Revit 2026 API

# RibbonPanelAddSlideOut Method

---

Adds a slideout to the current panel.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSlideOut()
```
```vb
Public Sub AddSlideOut
```
```cpp
public:
void AddSlideOut()
```
```fsharp
member AddSlideOut : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when a slide out panel is already added. |

The slideout part of the panel can be shown by clicking on the arrow at the bottom of the panel. After calling AddSlideOut(), any subsequent calls to add new items will add the new item(s) to the slideout. The slideout part of the panel will be shown only if items are added after this call.

#### Reference

RibbonPanel Class

Autodesk.Revit.UI Namespace